In [1]:
import pandas as pd

In [7]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [8]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [11]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [16]:
# First method of renaming:

ufo.rename(columns = {'Colors Reported' : "Colors_Reported", "Shape Reported" : "Shape_Reported"}, inplace = True)

In [19]:
ufo.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [18]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

In [33]:
# Second method of renaming (you have to supply all the names)

name1 = ['city', 'colors_reported', 'shape_reported', 'state', 'time']

In [34]:
# replacing all the column names using a list of name in one go. 
ufo.columns = name

In [58]:
ufo.columns

Index(['Ithaca', 'Unnamed: 1', 'TRIANGLE', 'NY', '6/1/1930 22:00'], dtype='object')

In [59]:
# This is how you positioned values in second and third rows as header.

ufo = pd.read_csv('http://bit.ly/uforeports', header = 1)

In [60]:
ufo

                     Ithaca Unnamed: 1  TRIANGLE  NY    6/1/1930 22:00
0               Willingboro        NaN     OTHER  NJ   6/30/1930 20:00
1                   Holyoke        NaN      OVAL  CO   2/15/1931 14:00
2                   Abilene        NaN      DISK  KS    6/1/1931 13:00
3      New York Worlds Fair        NaN     LIGHT  NY   4/18/1933 19:00
4               Valley City        NaN      DISK  ND   9/15/1934 15:30
...                     ...        ...       ...  ..               ...
18235            Grant Park        NaN  TRIANGLE  IL  12/31/2000 23:00
18236           Spirit Lake        NaN      DISK  IA  12/31/2000 23:00
18237           Eagle River        NaN       NaN  WI  12/31/2000 23:45
18238           Eagle River        RED     LIGHT  WI  12/31/2000 23:45
18239                  Ybor        NaN      OVAL  FL  12/31/2000 23:59

[18240 rows x 5 columns]

In [62]:
ufo = pd.read_csv('http://bit.ly/uforeports', header = 0)
ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [63]:
ufo.columns = ufo.columns.str.replace(" ", "_")

In [64]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

In [67]:
# Third method, can be used to make same change across hundred of columns
ufo.columns = ufo.columns.str.replace("_", " ")
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')